app/Controllers/Akun.php

SELECT *
FROM `login`
WHERE `login`.`id` = '1'
---
    public function index()
    {
        $model = new LoginModel();
        $userId = session()->get('id');
        $user = $model->find($userId);