app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `data_karakter`
---
    public function index()
    {
        $karakterModel = new \App\Models\KarakterModel();
        $historyModel = new \App\Models\HistoryModel();

        // Get total data
        $totalDataset = $karakterModel->countAllResults();