app/Controllers/Klasifikasi.php

SELECT *
FROM `data_karakter`
---
    public function proses()
    {
        // 1. Ambil Input User
        $input = [
            'nama_siswa' => $this->request->getPost('nama_siswa'),
            'bersosialisasi' => (int)$this->request->getPost('bersosialisasi'),
            'berpendapat' => (int)$this->request->getPost('berpendapat'),
            'kestabilan_emosi' => (int)$this->request->getPost('kestabilan_emosi'),
            'kedisiplinan' => (int)$this->request->getPost('kedisiplinan'),
            'kepedulian' => (int)$this->request->getPost('kepedulian'),
            'kebersihan' => (int)$this->request->getPost('kebersihan'),
        ];

        // 2. Ambil Dataset Training
        $dataset = $this->dataKarakterModel->findAll();